newwms_gift/src/Reports/ит_WMS_МотивационныйОтчет/ит_WMS_МотивационныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ит_WMS_МотивационныйОтчет</name>
  <attributes>
    <name>СтоимостьКороба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКоробаПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеремещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеремещенияПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПаллетыНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияПаллеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическаяПроверка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опалечивание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаНаборку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПаллетыОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиПМУНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиПроверка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборкиРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПаллетыПриемки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАкта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаНаборкуРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроверкиРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗаПосещениеЯчейкиНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаНаценокПоКА</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗадачи</name>
      <type>
        <types>EnumRef.итWMSТипыЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЗадачу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

newwms_gift/src/Reports/ит_WMS_МотивационныйОтчет/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка    = Ложь;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ЗначениеПараметра.Значение = ДатаНачала;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	ЗначениеПараметра.Значение = ДатаОкончания;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьКороба");
	ЗначениеПараметра.Значение = СтоимостьКороба;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьКоробаПМУ");
	ЗначениеПараметра.Значение = СтоимостьКоробаПМУ;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПаллетыНаборки");
	ЗначениеПараметра.Значение = СтоимостьПаллетыНаборки;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПеремещения");
	ЗначениеПараметра.Значение = СтоимостьПеремещения;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПМУПеремещения");
	ЗначениеПараметра.Значение = СтоимостьПеремещенияПМУ;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПодъема");
	ЗначениеПараметра.Значение = СтоимостьПодъема;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьСпуска");
	ЗначениеПараметра.Значение = СтоимостьСпуска;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("АгрегацияПаллеты");
	ЗначениеПараметра.Значение = АгрегацияПаллеты;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФизическаяПроверка");
	ЗначениеПараметра.Значение = ФизическаяПроверка;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("АгрегацияКоробов");
	ЗначениеПараметра.Значение = АгрегацияКоробов;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Опалечивание");
	ЗначениеПараметра.Значение = Опалечивание;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьЗаНаборку");
	ЗначениеПараметра.Значение = СтоимостьЗаНаборку;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьОтгрузки");
	ЗначениеПараметра.Значение = СтоимостьОтгрузки;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПаллетыОтгрузки");
	ЗначениеПараметра.Значение = СтоимостьПаллетыОтгрузки;
	ЗначениеПараметра.Использование = Истина;

	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьБутылкиНаборка");
	ЗначениеПараметра.Значение = СтоимостьБутылкиНаборка;
	ЗначениеПараметра.Использование = Истина;

	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьБутылкиПМУНаборка");
	ЗначениеПараметра.Значение = СтоимостьБутылкиПМУНаборка;
	ЗначениеПараметра.Использование = Истина;

	
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьБутылкиПроверка");
	ЗначениеПараметра.Значение = СтоимостьБутылкиПроверка;
	ЗначениеПараметра.Использование = Истина;
	
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьНаборки");
	ЗначениеПараметра.Значение = СтоимостьНаборки;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьНаборкиРозница");
	ЗначениеПараметра.Значение = СтоимостьНаборкиРозница;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СуммаПаллетыПриемки");
	ЗначениеПараметра.Значение = СуммаПаллетыПриемки;
	ЗначениеПараметра.Использование = Истина;

	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СуммаАкта");
	ЗначениеПараметра.Значение = СуммаАкта;
	ЗначениеПараметра.Использование = Истина;

    ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьЗаНаборкуРозница");
	ЗначениеПараметра.Значение = СтоимостьЗаНаборкуРозница;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьЗаПосещениеЯчейкиНаборка");
	ЗначениеПараметра.Значение = СтоимостьЗаПосещениеЯчейкиНаборка;
	ЗначениеПараметра.Использование = Истина;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПроверкиРозница");
	ЗначениеПараметра.Значение = СтоимостьПроверкиРозница;
	ЗначениеПараметра.Использование = Истина;

	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтоимостьПроверки");
	ЗначениеПараметра.Значение = СтоимостьПроверки;
	ЗначениеПараметра.Использование = Истина;


 
	 
    НаборыДанных    = Новый Структура("ТаблицаНаценокПоКА", ТаблицаНаценокПоКА.Выгрузить());
     
    Схема   = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
     
    КМ      = Новый КомпоновщикМакетаКомпоновкиДанных;
    Настройки=КомпоновщикНастроек.ПолучитьНастройки();  
    Макет   = КМ.Выполнить(Схема,Настройки,ДанныеРасшифровки);
     
   	
    ПК  = Новый ПроцессорКомпоновкиДанных;
    ПК.Инициализировать(Макет, НаборыДанных,ДанныеРасшифровки);
     
    ПВ  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПВ.УстановитьДокумент(ДокументРезультат);
    ПВ.Вывести(ПК,Истина);

	


КонецПроцедуры
